150825ctsad/01-1_STM32U575_Software_Config/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32u5xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */
void Update_Backlight(uint8_t pDutyRatio);
/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BULE_LED_Pin GPIO_PIN_13
#define BULE_LED_GPIO_Port GPIOC
#define LCD_DXC_Pin GPIO_PIN_4
#define LCD_DXC_GPIO_Port GPIOA
#define LCD_RST_Pin GPIO_PIN_8
#define LCD_RST_GPIO_Port GPIOA
#define TP_RST_Pin GPIO_PIN_11
#define TP_RST_GPIO_Port GPIOA
#define RUN_BEE_Pin GPIO_PIN_15
#define RUN_BEE_GPIO_Port GPIOA
#define TP_INT_Pin GPIO_PIN_5
#define TP_INT_GPIO_Port GPIOB
#define TP_INT_EXTI_IRQn EXTI5_IRQn

/* USER CODE BEGIN Private defines */
#define LCD_RST_Pin GPIO_PIN_8
#define LCD_RST_GPIO_Port GPIOA
#define LCD_DCX_Pin GPIO_PIN_4
#define LCD_DCX_GPIO_Port GPIOA
#define TP_RST_Pin GPIO_PIN_11
#define TP_RST_GPIO_Port GPIOA
/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
